anynsyun1/STM32H723I_FBANK1--mcu_delay_test-/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define FC2_Pin GPIO_PIN_14
#define FC2_GPIO_Port GPIOD
#define LED_CH1_Pin GPIO_PIN_15
#define LED_CH1_GPIO_Port GPIOD
#define LED_CH3_Pin GPIO_PIN_6
#define LED_CH3_GPIO_Port GPIOC
#define LED_CH5_Pin GPIO_PIN_7
#define LED_CH5_GPIO_Port GPIOC
#define LED_CH2_Pin GPIO_PIN_9
#define LED_CH2_GPIO_Port GPIOA
#define BIT_EN_Pin GPIO_PIN_2
#define BIT_EN_GPIO_Port GPIOD
#define LED_CH6_Pin GPIO_PIN_3
#define LED_CH6_GPIO_Port GPIOD
#define LED_CH4_Pin GPIO_PIN_4
#define LED_CH4_GPIO_Port GPIOD
#define FC1_Pin GPIO_PIN_6
#define FC1_GPIO_Port GPIOD
#define FC3_Pin GPIO_PIN_3
#define FC3_GPIO_Port GPIOB
#define BIT_ENB4_Pin GPIO_PIN_4
#define BIT_ENB4_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
